In [1]:
import pandas as pd

In [15]:
filename = "./DataFiles/time.csv"
data = pd.read_csv(filename)

df = pd.DataFrame(data)
df.head()

         date   spent  recevied
0  2023-04-22  251.37   4725.96
1  2016-11-12  966.07   2503.87
2  2016-09-09  718.60   1717.93
3  2024-10-20   66.60   4940.20
4  2016-02-04     NaN   1417.34

In [16]:
df.dtypes

date         object
spent       float64
recevied    float64
dtype: object

In [17]:
df['date'] = pd.to_datetime(df['date'])
df.dtypes

date        datetime64[ns]
spent              float64
recevied           float64
dtype: object

In [18]:
df.set_index('date',inplace=True)
df.head()

             spent  recevied
date
2023-04-22  251.37   4725.96
2016-11-12  966.07   2503.87
2016-09-09  718.60   1717.93
2024-10-20   66.60   4940.20
2016-02-04     NaN   1417.34

In [19]:
df.sort_index()

              spent  recevied
date
2015-12-11  2502.00   2898.84
2015-12-11  3210.31   3185.85
2015-12-14      NaN   4902.02
2015-12-15  1634.54   2667.52
2015-12-15  2751.87     42.55
...             ...       ...
2024-12-06  3461.64   4507.27
2024-12-07   878.44    358.37
2024-12-08  1914.99   4937.34
2024-12-08  2352.44   1644.57
2024-12-09  1805.57   2128.08

[5000 rows x 2 columns]

In [20]:
weekly_data = df.resample('W').sum()
weekly_data.head()

               spent  recevied
date
2015-12-13   5712.31   6084.69
2015-12-20  10125.87  15747.87
2015-12-27  12243.76  20808.22
2016-01-03  11726.76  16676.22
2016-01-10  17268.50  30992.40

In [22]:
total_spent = weekly_data['spent'].sum()
total_spent

8705913.38

In [24]:
total_received = weekly_data['recevied'].sum()
total_received

11894788.100000001

In [26]:
weekly_data['profit/loss'] = weekly_data['recevied'] - weekly_data['spent']
weekly_data.head()

               spent  recevied  profit/loss
date
2015-12-13   5712.31   6084.69       372.38
2015-12-20  10125.87  15747.87      5622.00
2015-12-27  12243.76  20808.22      8564.46
2016-01-03  11726.76  16676.22      4949.46
2016-01-10  17268.50  30992.40     13723.90

In [27]:
total = total_received - total_spent
total

3188874.7200000007

In [29]:
weekly_data['rollingspent'] = weekly_data['spent'].rolling(window=3).mean()
weekly_data.head()

               spent  recevied  profit/loss  rollingspent
date
2015-12-13   5712.31   6084.69       372.38           NaN
2015-12-20  10125.87  15747.87      5622.00           NaN
2015-12-27  12243.76  20808.22      8564.46   9360.646667
2016-01-03  11726.76  16676.22      4949.46  11365.463333
2016-01-10  17268.50  30992.40     13723.90  13746.340000

In [30]:
weekly_data['rollingrecevied'] = weekly_data['recevied'].rolling(window=3).mean()
weekly_data.head()

               spent  recevied  profit/loss  rollingspent  rollingrecevied
date
2015-12-13   5712.31   6084.69       372.38           NaN              NaN
2015-12-20  10125.87  15747.87      5622.00           NaN              NaN
2015-12-27  12243.76  20808.22      8564.46   9360.646667     14213.593333
2016-01-03  11726.76  16676.22      4949.46  11365.463333     17744.103333
2016-01-10  17268.50  30992.40     13723.90  13746.340000     22825.613333

In [31]:
weekly_data['prev_profit/loss'] = weekly_data['profit/loss'].shift(1)
weekly_data.head()

,spent,recevied,profit/loss,rollingspent,rollingrecevied,prev_profit/loss
date,,,,,,
2015-12-13,5712.31,6084.69,372.38,NaN,NaN,NaN
2015-12-20,10125.87,15747.87,5622.00,NaN,NaN,372.38
2015-12-27,12243.76,20808.22,8564.46,9360.646667,14213.593333,5622.00
2016-01-03,11726.76,16676.22,4949.46,11365.463333,17744.103333,8564.46
2016-01-10,17268.50,30992.40,13723.90,13746.340000,22825.613333,4949.46